{
  "id": "grid",
  "title": "The Grid - Where Memory Lives",
  "narrations": {
    "en": "Welcome to the foundation of how this brain works. Imagine a city map where every intersection can hold memories. This is our grid - a two-dimensional space where experiences are stored.\n\nIn your own brain, neurons don't store memories as isolated facts. Instead, memories are distributed across networks, tied to locations in neural space. Our grid works similarly - it's an addressable memory, like a vast warehouse where every shelf has a unique address.\n\nWhy a grid? Because location matters. When you remember where you left your keys, you're not just recalling \"keys\" - you're recalling a place. The hippocampus, your brain's memory center, uses \"place cells\" that fire at specific locations. We're borrowing this biological insight.\n\nEach cell in our grid can hold multiple \"tokens\" - think of tokens as atomic pieces of meaning, like words or concepts. But unlike a simple list, here position IS information. The WHERE and the WHAT become intertwined, just like in human episodic memory.\n\nThis is the first key insight: memory is not just content, it's content at a location. Address plus data. Where plus what.",

    "pt": "Bem-vindo à fundação de como este cérebro funciona. Imagine um mapa da cidade onde cada cruzamento pode guardar memórias. Esta é nossa grade - um espaço bidimensional onde experiências são armazenadas.\n\nNo seu próprio cérebro, os neurônios não armazenam memórias como fatos isolados. Em vez disso, as memórias são distribuídas em redes, ligadas a localizações no espaço neural. Nossa grade funciona de forma similar - é uma memória endereçável, como um vasto armazém onde cada prateleira tem um endereço único.\n\nPor que uma grade? Porque a localização importa. Quando você lembra onde deixou suas chaves, não está apenas recordando \"chaves\" - está recordando um lugar. O hipocampo, o centro de memória do seu cérebro, usa \"células de lugar\" que disparam em localizações específicas. Estamos emprestando essa percepção biológica.\n\nCada célula em nossa grade pode conter múltiplos \"tokens\" - pense em tokens como peças atômicas de significado, como palavras ou conceitos. Mas diferente de uma lista simples, aqui a posição É informação. O ONDE e o QUÊ se entrelaçam, assim como na memória episódica humana.\n\nEsta é a primeira percepção chave: memória não é apenas conteúdo, é conteúdo em uma localização. Endereço mais dados. Onde mais o quê.",

    "ro": "Bine ai venit la fundația modului în care funcționează acest creier. Imaginează-ți o hartă a orașului unde fiecare intersecție poate păstra amintiri. Aceasta este grila noastră - un spațiu bidimensional unde experiențele sunt stocate.\n\nÎn propriul tău creier, neuronii nu stochează amintirile ca fapte izolate. În schimb, amintirile sunt distribuite în rețele, legate de locații în spațiul neural. Grila noastră funcționează similar - este o memorie adresabilă, ca un depozit vast unde fiecare raft are o adresă unică.\n\nDe ce o grilă? Pentru că locația contează. Când îți amintești unde ți-ai lăsat cheile, nu îți amintești doar \"chei\" - îți amintești un loc. Hipocampul, centrul de memorie al creierului tău, folosește \"celule de loc\" care se activează la locații specifice. Noi împrumutăm această perspectivă biologică.\n\nFiecare celulă din grila noastră poate conține multiple \"token-uri\" - gândește-te la token-uri ca la piese atomice de semnificație, precum cuvinte sau concepte. Dar spre deosebire de o listă simplă, aici poziția ESTE informație. UNDE și CE devin întrepătrunse, exact ca în memoria episodică umană.\n\nAceasta este prima perspectivă cheie: memoria nu este doar conținut, este conținut la o locație. Adresă plus date. Unde plus ce."
  }
}
