{
  "id": "alignment",
  "title": "Frame Alignment - Agreeing on \"Where\" Across Columns",
  "narrations": {
    "en": "We have multiple columns. Each one has its own \"map\" and its own coordinates. That means each column lives in its own reference frame.\n\nThis is subtle but important: a location like (15, 14) in Column 1 is not automatically the same place as (15, 14) in Column 2, because Column 2 started from a different origin. They might be describing the same underlying memory state, but expressed in different coordinates.\n\nIn biology, Thousand Brains theory says each cortical column learns objects in its own reference frame. Columns then align their frames using shared evidence so they can agree on what they are sensing.\n\nIn our simplified grid demo, alignment is mostly a translation: we know each column's starting offset. So we can convert a candidate location from Column 2 into Column 1's frame by subtracting Column 2's origin and adding Column 1's origin.\n\nWhy do we need this? Because voting only makes sense if everyone is voting on comparable options. Without alignment, three columns could point to the same latent location but in three different coordinate systems. The vote would look split, and confidence would drop for the wrong reason.\n\nSo the workflow becomes: each column proposes a candidate location, we align those candidates into a shared frame, we group equivalent candidates, and then we vote. Alignment turns \"many viewpoints\" into a single, coherent estimate.",
    "pt": "We have multiple columns. Each one has its own map and its own coordinates. That means each column lives in its own reference frame. Alignment converts candidate locations into a shared frame so voting becomes meaningful.",
    "ro": "Avem mai multe coloane. Fiecare are propria ei \"hartă\" și propriile ei coordonate. Asta înseamnă că fiecare coloană trăiește într-un cadru de referință separat.\n\nEste un detaliu subtil, dar crucial: o locație precum (15, 14) în Coloana 1 nu este automat același loc ca (15, 14) în Coloana 2, pentru că Coloana 2 a pornit dintr-o origine diferită. Ele pot descrie aceeași stare de memorie, dar exprimată în coordonate diferite.\n\nÎn biologie, teoria Celor O Mie de Creiere spune că fiecare coloană corticală învață obiecte în propriul ei cadru de referință. Coloanele își aliniază apoi cadrele folosind evidență comună, ca să poată fi de acord asupra a ceea ce percep.\n\nÎn demo-ul nostru simplificat pe grilă, alinierea este în mare parte o translație: știm offset-ul de pornire al fiecărei coloane. Deci putem converti o locație candidată din Coloana 2 în cadrul Coloanei 1 scăzând originea Coloanei 2 și adăugând originea Coloanei 1.\n\nDe ce avem nevoie de asta? Pentru că votarea are sens doar dacă toți votează opțiuni comparabile. Fără aliniere, trei coloane pot indica aceeași locație latentă, dar în trei sisteme de coordonate diferite. Votul ar părea „împărțit”, iar încrederea ar scădea dintr-un motiv greșit.\n\nDeci fluxul devine: fiecare coloană propune o locație candidată, aliniem candidații într-un cadru comun, grupăm candidații echivalenți, apoi votăm. Alinierea transformă \"multe perspective\" într-o estimare unică și coerentă."
  }
}

