{
  "id": "localization",
  "title": "Localization - Where Am I in Memory Space?",
  "narrations": {
    "en": "How do you know where you are? Not physically, but mentally - in the space of a conversation, a book, a memory. You're constantly answering the question: \"Have I been here before? Where exactly?\"\n\nThis is localization - using current context to find your position in memory space. It's like GPS for the mind.\n\nWhen you hear \"to be or not to be,\" your brain instantly locates that phrase in Hamlet. You don't search randomly - the words themselves tell you where to look. The context is the address.\n\nOur system does the same. Given the last few tokens, it searches the grid for cells that contain those tokens. Each match becomes a \"candidate location\" - a hypothesis about where we might be in the stored experience.\n\nBut here's the subtlety: there might be multiple matches. The phrase \"she said\" could appear in thousands of stories. Each match gets a confidence score based on how well it fits the broader context.\n\nIn cognitive science, this relates to \"recognition memory\" - your ability to know that you've encountered something before, even if you can't fully recall it. Localization is the computational mechanism behind that feeling of familiarity.\n\nThe candidates are ranked, and the best matches rise to the top. This isn't just retrieval - it's positioning. Finding where you stand in a vast landscape of past experience.",

    "pt": "Como você sabe onde está? Não fisicamente, mas mentalmente - no espaço de uma conversa, um livro, uma memória. Você está constantemente respondendo: \"Já estive aqui antes? Onde exatamente?\"\n\nIsso é localização - usar contexto atual para encontrar sua posição no espaço de memória. É como GPS para a mente.\n\nQuando você ouve \"ser ou não ser,\" seu cérebro instantaneamente localiza essa frase em Hamlet. Você não busca aleatoriamente - as próprias palavras dizem onde procurar. O contexto é o endereço.\n\nNosso sistema faz o mesmo. Dados os últimos tokens, ele busca na grade por células que contêm esses tokens. Cada correspondência se torna uma \"localização candidata\" - uma hipótese sobre onde podemos estar na experiência armazenada.\n\nMas aqui está a sutileza: pode haver múltiplas correspondências. A frase \"ela disse\" pode aparecer em milhares de histórias. Cada correspondência recebe uma pontuação de confiança baseada em quão bem se ajusta ao contexto mais amplo.\n\nNa ciência cognitiva, isso se relaciona com \"memória de reconhecimento\" - sua capacidade de saber que encontrou algo antes, mesmo se não pode recordar completamente. Localização é o mecanismo computacional por trás desse sentimento de familiaridade.",

    "ro": "Cum știi unde ești? Nu fizic, ci mental - în spațiul unei conversații, al unei cărți, al unei amintiri. Răspunzi constant la întrebarea: \"Am mai fost aici? Unde exact?\"\n\nAceasta este localizarea - folosirea contextului curent pentru a găsi poziția ta în spațiul memoriei. Este ca GPS-ul pentru minte.\n\nCând auzi \"a fi sau a nu fi,\" creierul tău localizează instant acea frază în Hamlet. Nu cauți aleatoriu - cuvintele în sine îți spun unde să cauți. Contextul este adresa.\n\nSistemul nostru face același lucru. Având ultimele token-uri, caută în grilă celule care conțin acele token-uri. Fiecare potrivire devine o \"locație candidată\" - o ipoteză despre unde am putea fi în experiența stocată.\n\nDar iată subtilitatea: pot exista potriviri multiple. Fraza \"ea a spus\" ar putea apărea în mii de povești. Fiecare potrivire primește un scor de încredere bazat pe cât de bine se potrivește cu contextul mai larg.\n\nÎn știința cognitivă, aceasta se leagă de \"memoria de recunoaștere\" - abilitatea ta de a ști că ai întâlnit ceva înainte, chiar dacă nu îți poți aminti complet. Localizarea este mecanismul computațional din spatele acelui sentiment de familiaritate."
  }
}
