{
  "id": "voting",
  "title": "Voting & Consensus - Democracy of Neural Columns",
  "narrations": {
    "en": "Now the columns talk to each other. Each has formed its own opinion about where we are in memory. Now they vote.\n\nThis is democratic intelligence. No single column is the authority - truth emerges from consensus. Like a jury deliberating, each column presents its evidence and the group decides.\n\nBut unlike simple voting, our columns share information laterally. \"I think we're in scene 5 of Hamlet\" says one column. \"I agree, the context matches perfectly,\" responds another. \"Wait, I see evidence for Romeo and Juliet,\" objects a third.\n\nWhen columns agree, confidence is high - you can trust the answer. When they disagree significantly, you've found ambiguity. The system doesn't just give answers; it knows when it doesn't know.\n\nIn your brain, this lateral communication happens through horizontal connections between cortical columns. They're constantly checking with their neighbors: \"Do you see what I see?\"\n\nThis relates to a profound psychological phenomenon: the feeling of certainty. Why do some memories feel rock-solid while others feel fuzzy? It correlates with how many neural columns agreed. Consensus creates confidence.\n\nThe voting isn't just about finding answers - it's about detecting conflicts and contradictions. If the evidence supports multiple incompatible interpretations, the system surfaces that disagreement rather than hiding it.",

    "pt": "Agora as colunas conversam entre si. Cada uma formou sua própria opinião sobre onde estamos na memória. Agora elas votam.\n\nEsta é inteligência democrática. Nenhuma coluna é a autoridade - a verdade emerge do consenso. Como um júri deliberando, cada coluna apresenta sua evidência e o grupo decide.\n\nMas diferente de votação simples, nossas colunas compartilham informação lateralmente. \"Acho que estamos na cena 5 de Hamlet\" diz uma coluna. \"Concordo, o contexto combina perfeitamente,\" responde outra. \"Espere, vejo evidência para Romeu e Julieta,\" objeta uma terceira.\n\nQuando colunas concordam, a confiança é alta - você pode confiar na resposta. Quando discordam significativamente, você encontrou ambiguidade. O sistema não apenas dá respostas; ele sabe quando não sabe.\n\nNo seu cérebro, essa comunicação lateral acontece através de conexões horizontais entre colunas corticais. Elas constantemente verificam com seus vizinhos: \"Você vê o que eu vejo?\"\n\nIsso se relaciona com um fenômeno psicológico profundo: o sentimento de certeza. Por que algumas memórias parecem sólidas enquanto outras parecem nebulosas? Correlaciona com quantas colunas neurais concordaram. Consenso cria confiança.",

    "ro": "Acum coloanele vorbesc între ele. Fiecare și-a format propria opinie despre unde suntem în memorie. Acum votează.\n\nAceasta este inteligență democratică. Nicio coloană nu este autoritatea - adevărul emerge din consens. Ca un juriu deliberând, fiecare coloană își prezintă dovezile și grupul decide.\n\nDar spre deosebire de votul simplu, coloanele noastre împărtășesc informații lateral. \"Cred că suntem în scena 5 din Hamlet\" spune o coloană. \"Sunt de acord, contextul se potrivește perfect,\" răspunde alta. \"Stați, văd dovezi pentru Romeo și Julieta,\" obiectează a treia.\n\nCând coloanele sunt de acord, încrederea este mare - poți avea încredere în răspuns. Când nu sunt de acord semnificativ, ai găsit ambiguitate. Sistemul nu doar dă răspunsuri; știe când nu știe.\n\nÎn creierul tău, această comunicare laterală se întâmplă prin conexiuni orizontale între coloanele corticale. Ele verifică constant cu vecinii lor: \"Vezi ce văd eu?\"\n\nAceasta se leagă de un fenomen psihologic profund: sentimentul de certitudine. De ce unele amintiri par solide în timp ce altele par neclare? Se corelează cu câte coloane neurale au fost de acord. Consensul creează încredere."
  }
}
