{
  "id": "heavyhitters",
  "title": "Heavy-Hitters - Bounded Memory, Graceful Forgetting",
  "narrations": {
    "en": "Memory cannot be infinite. Every storage system must decide what to keep and what to forget. This lesson is about graceful forgetting - keeping what matters while letting go of what doesn't.\n\nThe term \"heavy-hitter\" comes from computer science. In a stream of items, heavy-hitters are the frequent ones - the items that appear again and again. We track these, not the rare one-offs.\n\nEach cell in our grid has limited capacity - it can hold only K tokens, typically 4 or 8. When a new token arrives, if there's room, we add it and count how often we've seen it. But when the cell is full and a new token arrives, something must give.\n\nWe evict the least frequent token - the lightweight, not the heavy-hitter. This is intelligent forgetting: keep what's common and reliable, forget what's rare and potentially noisy.\n\nWhy does this matter psychologically? Your brain does the same thing. You don't remember every face you've ever glimpsed - you remember the faces you've seen frequently. Repetition creates persistence. This is called the \"spacing effect\" in memory research.\n\nThe beauty of this approach is graceful degradation. When memory fills up, it doesn't crash or refuse new information. It gets a little fuzzier, but keeps working. Each cell becomes a summary of what has passed through it most often.\n\nSaturation - when cells get full - is a signal, not a failure. It tells us that this region of memory space is well-traveled, densely experienced.",

    "pt": "Memória não pode ser infinita. Todo sistema de armazenamento deve decidir o que manter e o que esquecer. Esta lição é sobre esquecimento gracioso - mantendo o que importa enquanto deixa ir o que não importa.\n\nO termo \"heavy-hitter\" vem da ciência da computação. Em um fluxo de itens, heavy-hitters são os frequentes - os itens que aparecem repetidamente. Rastreamos estes, não os raros únicos.\n\nCada célula em nossa grade tem capacidade limitada - pode conter apenas K tokens, tipicamente 4 ou 8. Quando um novo token chega, se há espaço, adicionamos e contamos quantas vezes vimos. Mas quando a célula está cheia e um novo token chega, algo deve ceder.\n\nDespejamos o token menos frequente - o leve, não o heavy-hitter. Isso é esquecimento inteligente: mantenha o que é comum e confiável, esqueça o que é raro e potencialmente ruidoso.\n\nPor que isso importa psicologicamente? Seu cérebro faz a mesma coisa. Você não lembra cada rosto que já vislumbrou - lembra os rostos que viu frequentemente. Repetição cria persistência. Isso é chamado \"efeito de espaçamento\" na pesquisa de memória.\n\nA beleza desta abordagem é degradação graciosa. Quando a memória enche, não trava ou recusa nova informação. Fica um pouco mais nebulosa, mas continua funcionando.",

    "ro": "Memoria nu poate fi infinită. Fiecare sistem de stocare trebuie să decidă ce să păstreze și ce să uite. Această lecție este despre uitarea grațioasă - păstrând ce contează în timp ce lași să plece ce nu contează.\n\nTermenul \"heavy-hitter\" vine din informatică. Într-un flux de elemente, heavy-hitters sunt cele frecvente - elementele care apar din nou și din nou. Le urmărim pe acestea, nu pe cele rare care apar o singură dată.\n\nFiecare celulă din grila noastră are capacitate limitată - poate conține doar K token-uri, tipic 4 sau 8. Când un nou token sosește, dacă este loc, îl adăugăm și numărăm de câte ori l-am văzut. Dar când celula este plină și un nou token sosește, ceva trebuie să cedeze.\n\nEvacuăm token-ul cel mai puțin frecvent - cel ușor, nu heavy-hitter-ul. Aceasta este uitare inteligentă: păstrează ce este comun și de încredere, uită ce este rar și potențial zgomotos.\n\nDe ce contează aceasta psihologic? Creierul tău face același lucru. Nu îți amintești fiecare față pe care ai zărit-o vreodată - îți amintești fețele pe care le-ai văzut frecvent. Repetiția creează persistența. Aceasta se numește \"efectul de spațiere\" în cercetarea memoriei.\n\nFrumusețea acestei abordări este degradarea grațioasă. Când memoria se umple, nu se blochează sau refuză informații noi. Devine puțin mai neclară, dar continuă să funcționeze. Fiecare celulă devine un rezumat al a ceea ce a trecut prin ea cel mai des.\n\nSaturația - când celulele se umplu - este un semnal, nu un eșec. Îți spune că această regiune a spațiului de memorie este intens parcursă, dens experimentată."
  }
}
