{
  "id": "slowmaps",
  "title": "Slow Maps - Multiple Timescales of Memory",
  "narrations": {
    "en": "Your brain doesn't process everything at one speed. Some neurons respond to millisecond changes; others track patterns over minutes or hours. This hierarchy of timescales is essential for intelligence.\n\nIn our system, fast maps record every single step - detailed, moment-by-moment traces. But we also maintain slow maps that update only every N steps, capturing higher-level summaries.\n\nThink about watching a movie. Your fast system tracks every frame, every word of dialogue. But your slow system is building a summary: \"This is a romance. The protagonist is conflicted. The mood is melancholic.\" These abstractions operate on a different timescale.\n\nWhy multiple timescales? Because different questions require different levels of detail. \"What word did she say at minute 47?\" needs fast, detailed memory. \"What was the movie about?\" needs slow, abstract memory.\n\nIn neuroscience, this is called the \"temporal hierarchy\" of the cortex. Early sensory areas respond to fast changes; higher association areas respond to slower patterns. The brain literally processes at different speeds in different regions.\n\nFor practical memory systems, this means we can answer quick queries about recent details from fast maps, while long-range questions about overall patterns come from slow maps. Both are necessary; neither alone is sufficient.\n\nThis mirrors how human expertise works. A master chess player doesn't just see individual pieces - they see patterns, themes, trajectories. They've built slow maps over thousands of games.",

    "pt": "Seu cérebro não processa tudo em uma velocidade. Alguns neurônios respondem a mudanças de milissegundos; outros rastreiam padrões ao longo de minutos ou horas. Esta hierarquia de escalas temporais é essencial para inteligência.\n\nEm nosso sistema, mapas rápidos gravam cada passo - traços detalhados, momento a momento. Mas também mantemos mapas lentos que atualizam apenas a cada N passos, capturando resumos de nível superior.\n\nPense em assistir um filme. Seu sistema rápido rastreia cada quadro, cada palavra de diálogo. Mas seu sistema lento está construindo um resumo: \"Isto é um romance. O protagonista está conflitado. O humor é melancólico.\" Essas abstrações operam em uma escala temporal diferente.\n\nPor que múltiplas escalas temporais? Porque diferentes perguntas requerem diferentes níveis de detalhe. \"Que palavra ela disse no minuto 47?\" precisa de memória rápida e detalhada. \"Sobre o que era o filme?\" precisa de memória lenta e abstrata.\n\nNa neurociência, isso é chamado de \"hierarquia temporal\" do córtex. Áreas sensoriais iniciais respondem a mudanças rápidas; áreas de associação superiores respondem a padrões mais lentos. O cérebro literalmente processa em velocidades diferentes em diferentes regiões.",

    "ro": "Creierul tău nu procesează totul la o singură viteză. Unii neuroni răspund la schimbări de milisecunde; alții urmăresc pattern-uri de-a lungul minutelor sau orelor. Această ierarhie de scale temporale este esențială pentru inteligență.\n\nÎn sistemul nostru, hărțile rapide înregistrează fiecare pas - urme detaliate, moment cu moment. Dar menținem și hărți lente care se actualizează doar la fiecare N pași, capturând rezumate de nivel superior.\n\nGândește-te la vizionarea unui film. Sistemul tău rapid urmărește fiecare cadru, fiecare cuvânt de dialog. Dar sistemul tău lent construiește un rezumat: \"Aceasta este o poveste de dragoste. Protagonistul este în conflict. Atmosfera este melancolică.\" Aceste abstracții operează pe o scală temporală diferită.\n\nDe ce scale temporale multiple? Pentru că întrebări diferite necesită niveluri diferite de detaliu. \"Ce cuvânt a spus ea la minutul 47?\" are nevoie de memorie rapidă, detaliată. \"Despre ce era filmul?\" are nevoie de memorie lentă, abstractă.\n\nÎn neuroștiință, aceasta se numește \"ierarhia temporală\" a cortexului. Ariile senzoriale timpurii răspund la schimbări rapide; ariile de asociație superioare răspund la pattern-uri mai lente. Creierul literalmente procesează la viteze diferite în regiuni diferite.\n\nPentru sisteme de memorie practice, asta înseamnă că putem răspunde la întrebări rapide despre detalii recente din hărțile rapide, în timp ce întrebările pe termen lung despre pattern-uri generale vin din hărțile lente. Ambele sunt necesare; niciuna singură nu este suficientă.\n\nAceasta oglindește și cum funcționează expertiza umană. Un mare maestru de șah nu vede doar piese individuale - vede pattern-uri, teme, traiectorii. A construit hărți lente de-a lungul a mii de partide."
  }
}
