{
  "id": "verdicts",
  "title": "Answer Contract - Supported, Conflicting, Unsupported",
  "narrations": {
    "en": "When this system answers a question, it does not only produce words. It also produces a verdict. The verdict is the promise that makes the whole pipeline auditable.\n\nThere are three basic outcomes.\n\nFirst, supported: we can build an evidence chain that fully backs the claim. That chain can include source facts and derived facts, but every step is explicit and traceable.\n\nSecond, conflicting: we found credible evidence that disagrees. Maybe two sources report different values, or two time windows overlap in an incompatible way. In this case, the system does not pick a random winner. It surfaces the disagreement and keeps both claims with provenance.\n\nThird, unsupported: we cannot retrieve enough evidence to answer safely. This is not failure; it is honesty. The correct response is \"I don't know\" until better evidence arrives.\n\nNotice what this contract prevents: fluent hallucination. A model can always say something that sounds right. This system is forced to show its work.\n\nIn the visualization, we cycle through these outcomes. You will see the same kind of question paired with different evidence situations. The verdict label changes accordingly.\n\nKey idea: clarity beats confidence. If the evidence is weak or contradictory, the system says so explicitly.",
    "pt": "When the system answers, it also returns a verdict: supported, conflicting, or unsupported. The verdict is based on explicit evidence chains and provenance.",
    "ro": "Când acest sistem răspunde la o întrebare, nu produce doar cuvinte. Produce și un verdict. Verdictul este promisiunea care face întregul flux auditabil.\n\nExistă trei rezultate de bază.\n\nÎn primul rând, supported: putem construi un lanț de evidență care susține complet afirmația. Lanțul poate include fapte sursă și fapte derivate, dar fiecare pas este explicit și trasabil.\n\nÎn al doilea rând, conflicting: am găsit evidență credibilă care nu este de acord. Poate două surse raportează valori diferite, sau două ferestre temporale se suprapun într-un mod incompatibil. În acest caz, sistemul nu alege arbitrar un câștigător. Scoate la suprafață dezacordul și păstrează ambele afirmații cu proveniență.\n\nÎn al treilea rând, unsupported: nu putem recupera suficientă evidență ca să răspundem în siguranță. Asta nu este un eșec; este onestitate. Răspunsul corect este \"Nu știu\" până când apare evidență mai bună.\n\nObservă ce previne acest contract: halucinația fluentă. Un model poate spune oricând ceva care sună bine. Sistemul acesta este constrâns să își arate munca.\n\nÎn vizualizare, trecem pe rând prin aceste rezultate. Vei vedea același tip de întrebare asociat cu situații diferite de evidență. Eticheta verdictului se schimbă în consecință.\n\nIdeea cheie: claritatea este mai importantă decât încrederea. Dacă evidența este slabă sau contradictorie, sistemul spune asta explicit."
  }
}

