{
  "id": "derivation",
  "title": "Fact Derivation - Building Knowledge",
  "narrations": {
    "en": "Memory is useful, but knowledge grows when you can derive new facts from old ones. Derivation is controlled imagination: you apply a rule, and you get a conclusion.\n\nClassic example: 'Socrates is a man' and 'All men are mortal' implies 'Socrates is mortal'.\n\nIn our system, this is not a hidden neural trick. It is a recorded operation:\n\n1) A rule is a pattern with variables, like: if ?x is a man, then ?x is mortal.\n\n2) We search stored work signatures for facts that match the premises.\n\n3) Matching produces bindings, for example: ?x = Socrates.\n\n4) We write a new derived fact, and we attach its provenance: which rule fired, which premises were used, and which bindings were applied.\n\nThe important part is the 'because'. When you ask why, the system can show a compact proof chain. And if a premise later becomes conflicting, the derived fact can be flagged and re-evaluated.\n\nThis is how the system builds a knowledge graph that stays auditable.",
    "pt": "Conhecimento cresce através de derivação. Dados os fatos 'Sócrates é um homem' e 'Todos os homens são mortais', derivamos 'Sócrates é mortal'. Cada derivação é explícita: a regra aplicada, as premissas correspondidas, as ligações usadas. O fato derivado armazena sua linhagem completa. Quando você pergunta 'Por que Sócrates é mortal?', o sistema mostra a cadeia de raciocínio. Isso não é uma caixa preta. Cada conclusão rastreia através de passos lógicos até os fatos de origem. O grafo de conhecimento expande com auditabilidade completa.",
    "ro": "Memoria este utilă, dar cunoașterea crește atunci când poți deriva fapte noi din fapte vechi. Derivarea este imaginație controlată: aplici o regulă și obții o concluzie.\n\nExemplu clasic: 'Socrate este om' și 'Toți oamenii sunt muritori' implică 'Socrate este muritor'.\n\nÎn sistemul nostru, asta nu este un truc neural ascuns. Este o operație înregistrată:\n\n1) O regulă este un pattern cu variabile, de tipul: dacă ?x este om, atunci ?x este muritor.\n\n2) Căutăm în semnăturile de lucru stocate faptele care se potrivesc cu premisele.\n\n3) Potrivirea produce legări (bindings), de exemplu: ?x = Socrate.\n\n4) Scriem un fapt derivat nou și îi atașăm proveniența: ce regulă s-a aplicat, ce premise au fost folosite și ce legări au rezultat.\n\nPartea importantă este „pentru că”. Când întrebi de ce, sistemul poate arăta un lanț de dovadă compact. Iar dacă o premisă devine ulterior „conflicting”, faptul derivat poate fi marcat și reevaluat.\n\nAșa construiește sistemul un graf de cunoștințe care rămâne auditabil."
  }
}
