{
  "id": "entities",
  "title": "Entity Resolution - Who is Who?",
  "narrations": {
    "en": "Before you can reason, you have to know who is who. In text, the same entity can be mentioned with different names, nicknames, abbreviations, or typos. 'NYC', 'New York City', and 'the Big Apple' can all refer to the same place. And sometimes the same name can refer to different entities.\n\nEntity resolution is the layer that turns messy mentions into stable IDs.\n\nStep by step:\n\n1) For each mention, collect its context: nearby words, relations, and the facts it participates in.\n\n2) Compare mention contexts. Mentions that share many relations and co-occur with the same neighbors are more likely to be the same entity.\n\n3) Cluster and assign a canonical entity ID. Keep the original surface forms as aliases.\n\n4) Merge facts by canonical ID, but keep provenance so you can trace back which document and which wording produced each fact.\n\nThis matters for everything downstream: conflicts, retrieval, and derivation. If aliases are not linked, you miss evidence. If different entities are merged by mistake, you create fake contradictions.\n\nSo entity resolution is not just cleanup; it is the foundation for coherent, verifiable knowledge.",
    "pt": "A mesma entidade aparece sob muitos nomes. 'NYC', 'New York City', 'The Big Apple' todos referem ao mesmo lugar. Resolução de entidades liga esses aliases juntos. Usando similaridade de contexto e padrões de co-ocorrência, o sistema detecta quando nomes diferentes referem à mesma coisa. Um ID canônico é atribuído à entidade resolvida. Todos os fatos sobre a entidade são mesclados sob essa identidade unificada. Referências cruzadas mantêm o mapeamento de aliases para formas canônicas. Isso é essencial para construir conhecimento coerente de menções espalhadas através de documentos.",
    "ro": "Înainte să poți raționa, trebuie să știi cine este cine. În text, aceeași entitate poate apărea sub nume diferite, porecle, abrevieri sau greșeli de scriere. 'NYC', 'New York City' și 'The Big Apple' pot fi același loc. Iar uneori același nume poate desemna entități diferite.\n\nRezoluția entităților este stratul care transformă mențiunile dezordonate în ID-uri stabile.\n\nPas cu pas:\n\n1) Pentru fiecare mențiune, colectăm contextul: cuvinte din jur, relații și faptele în care apare.\n\n2) Comparăm contexte. Mențiunile care împart multe relații și co-ocurențe cu aceiași vecini au o probabilitate mai mare să fie aceeași entitate.\n\n3) Grupăm (clustering) și atribuim un ID canonic. Păstrăm formele originale ca aliasuri.\n\n4) Îmbinăm faptele sub ID-ul canonic, dar păstrăm proveniența ca să poți urmări înapoi din ce document și din ce formulare a venit fiecare fapt.\n\nAsta contează pentru tot ce urmează: conflicte, recuperare și derivare. Dacă aliasurile nu sunt legate, pierzi evidență. Dacă entități diferite sunt îmbinate greșit, creezi contradicții false.\n\nDeci rezoluția entităților nu este doar „curățenie”; este fundația pentru cunoaștere coerentă și verificabilă."
  }
}
