{
  "id": "displacement",
  "title": "Displacement - Context Determines Movement",
  "narrations": {
    "en": "Now we discover something profound: movement through this memory space is not random - it's determined by what just happened. This is displacement.\n\nThink about how you navigate your home in the dark. You don't need to see - your brain predicts the next step based on where you just were and what you just did. Context predicts movement.\n\nIn our system, we take the last few tokens - the recent context - and hash them mathematically to produce a displacement vector: how far to move in X and how far in Y. The crucial insight: the same context always produces the same displacement.\n\nWhy does this matter? Because it means similar experiences will trace similar paths through memory. If you've processed \"the cat sat\" before, and now you see it again, you'll walk the same trajectory. This is pattern recognition through spatial consistency.\n\nIn cognitive psychology, this relates to \"priming\" - how recent context shapes your next thought. Here, we've made it explicit and geometric. Your mental state literally moves through space based on what you just processed.\n\nThe displacement is like following footsteps in snow. If many experiences leave the same footprints, those paths become highways of association. Context doesn't just influence - it geometrically determines - where you go next.",
    "ro": "Acum descoperim ceva profund: mișcarea prin acest spațiu de memorie nu este aleatorie - este determinată de ceea ce tocmai s-a întâmplat. Aceasta este deplasarea.\n\nGândește-te cum navighezi prin casa ta în întuneric. Nu trebuie să vezi - creierul tău prezice următorul pas bazat pe unde tocmai ai fost și ce tocmai ai făcut. Contextul prezice mișcarea.\n\nÎn sistemul nostru, luăm ultimele token-uri - contextul recent - și le procesăm matematic pentru a produce un vector de deplasare: cât să ne mișcăm pe X și cât pe Y. Perspectiva crucială: același context produce întotdeauna aceeași deplasare.\n\nDe ce contează? Pentru că înseamnă că experiențe similare vor trasa căi similare prin memorie. Dacă ai procesat \"pisica a stat\" înainte, și acum vezi din nou, vei merge pe aceeași traiectorie. Aceasta este recunoașterea pattern-urilor prin consistență spațială.\n\nÎn psihologia cognitivă, aceasta se leagă de \"priming\" - cum contextul recent modelează următorul tău gând. Aici, am făcut-o explicită și geometrică. Starea ta mentală se mișcă literal prin spațiu bazat pe ce tocmai ai procesat.\n\nDeplasarea este ca urmărirea urmelor în zăpadă. Dacă multe experiențe lasă aceleași urme, acele căi devin autostrăzi ale asocierii."
  },
  "keyIdeas": {
    "en": "Movement is determined by content. Similar sequences follow similar paths.",
    "ro": "Mișcarea este determinată de conținut. Secvențele similare urmează căi similare."
  }
}
