{
  "id": "multicolumn",
  "title": "Multiple Columns - Many Minds, One Truth",
  "narrations": {
    "en": "Now we multiply perspectives. In your brain, you don't have one opinion about what you're seeing - you have thousands of minicolumns, each processing the same input from a slightly different viewpoint. This is the Thousand Brains theory.\n\nImagine three witnesses to an event, each standing in a different spot. They see the same thing, but from different angles. If all three agree on what happened, you can be confident. If they disagree, you know something is ambiguous.\n\nEach column in our system is like an independent witness. They all receive the same sequence of tokens, but they start at different locations on the grid. Because of how displacement works, they trace different paths - but those paths have the same structure.\n\nThis is profound redundancy. Not wasteful repetition, but informative diversity. When the columns agree, you have high confidence. When they diverge, you've discovered ambiguity or novelty.\n\nIn psychology, this mirrors how experts make decisions. A good doctor doesn't rely on one mental model - they consider multiple diagnoses simultaneously. Each \"column\" of expertise votes on what's happening.\n\nThe word \"column\" comes from the neocortex's physical structure - cylindrical bundles of neurons that process information semi-independently. We're implementing that biological architecture computationally.\n\nMany minds, consulting the same evidence, reaching consensus - this is how robust intelligence emerges.",
    "ro": "Acum multiplicăm perspectivele. În creierul tău, nu ai o singură opinie despre ce vezi - ai mii de minicoloane, fiecare procesând aceeași intrare dintr-un punct de vedere ușor diferit. Aceasta este teoria Celor O Mie de Creiere.\n\nImaginează-ți trei martori la un eveniment, fiecare stând într-un loc diferit. Văd același lucru, dar din unghiuri diferite. Dacă toți trei sunt de acord cu ce s-a întâmplat, poți fi încrezător. Dacă nu sunt de acord, știi că ceva este ambiguu.\n\nFiecare coloană în sistemul nostru este ca un martor independent. Toate primesc aceeași secvență de token-uri, dar încep la locații diferite pe grilă. Din cauza modului în care funcționează deplasarea, trasează căi diferite - dar acele căi au aceeași structură.\n\nAceasta este redundanță profundă. Nu repetiție irosită, ci diversitate informativă. Când coloanele sunt de acord, ai încredere mare. Când diverg, ai descoperit ambiguitate sau noutate.\n\nÎn psihologie, aceasta oglindește cum iau deciziile experții. Un doctor bun nu se bazează pe un singur model mental - consideră simultan diagnostice multiple. Fiecare \"coloană\" de expertiză votează asupra a ceea ce se întâmplă.\n\nCuvântul \"coloană\" vine din structura fizică a neocortexului - fascicule cilindrice de neuroni care procesează informația semi-independent. Noi implementăm acea arhitectură biologică în mod computațional.\n\nMulte minți, consultând aceeași evidență, ajungând la consens - așa emerge inteligența robustă."
  },
  "keyIdeas": {
    "en": "Many columns = many perspectives on the same sequence.",
    "ro": "Multe coloane = multe perspective asupra aceleiași secvențe."
  }
}
