{
  "id": "replay",
  "title": "Replay & Checkpoints - Reconstructing the Past",
  "narrations": {
    "en": "How do you remember where you put your keys yesterday? You don't have a direct recording - you reconstruct. You mentally replay the sequence: \"I came home, I hung my coat, I walked to the kitchen...\" Until you reach the moment with the keys.\n\nThis is replay - reconstructing past states by re-walking the path from a known starting point. It's how biological memory works, and it's how our system answers queries about the past.\n\nCheckpoints are saved snapshots - moments where we recorded exactly where all the columns were positioned. Think of them like save points in a video game. From a checkpoint, you can replay forward to reach any subsequent state.\n\nWhy not just store every state directly? Because that would require enormous storage. Instead, we store only checkpoints and the sequence of events. The state at any moment can be reconstructed by replaying from the nearest checkpoint.\n\nThis trades storage for computation. We save space by not storing every state, but we pay time to reconstruct them. The art is choosing how often to checkpoint - frequent checkpoints mean fast reconstruction but more storage; sparse checkpoints mean slow reconstruction but less storage.\n\nIn neuroscience, this relates to \"mental time travel\" - your ability to vividly re-experience past events. You're not playing back a recording; you're reconstructing, using stored fragments to rebuild the experience.\n\nSleep researchers believe that memory consolidation during sleep involves exactly this kind of replay - your brain re-walks the paths of the day, strengthening important connections.",
    "ro": "Cum îți amintești unde ți-ai pus cheile ieri? Nu ai o înregistrare directă - reconstruiești. Reluezi mental secvența: \"Am venit acasă, mi-am atârnat haina, am mers la bucătărie...\" Până ajungi la momentul cu cheile.\n\nAceasta este reluarea - reconstruind stări trecute remergând calea de la un punct de pornire cunoscut. Așa funcționează memoria biologică, și așa răspunde sistemul nostru la întrebări despre trecut.\n\nCheckpoint-urile sunt instantanee salvate - momente când am înregistrat exact unde erau poziționate toate coloanele. Gândește-te la ele ca la puncte de salvare într-un joc video. De la un checkpoint, poți relua înainte pentru a ajunge la orice stare ulterioară.\n\nDe ce să nu stocăm fiecare stare direct? Pentru că ar necesita stocare enormă. În schimb, stocăm doar checkpoint-uri și secvența de evenimente. Starea în orice moment poate fi reconstruită reluând de la cel mai apropiat checkpoint.\n\nAceasta schimbă stocare pentru calcul. Economisim spațiu nestocând fiecare stare, dar plătim timp pentru a o reconstrui. Arta este să alegi cât de des faci checkpoint: checkpoint-uri dese înseamnă reconstrucție rapidă dar mai multă stocare; checkpoint-uri rare înseamnă reconstrucție lentă dar mai puțină stocare.\n\nÎn neuroștiință, aceasta se leagă de \"călătoria mentală în timp\" - abilitatea ta de a re-experimenta viu evenimente trecute. Nu redai o înregistrare; reconstruiești, folosind fragmente stocate pentru a reconstrui experiența.\n\nCercetătorii somnului cred că consolidarea memoriei în timpul somnului implică exact acest tip de reluare: creierul își re-parcurge căile zilei, întărind conexiunile importante."
  },
  "keyIdeas": {
    "en": "State is not stored directly—it is reconstructed by replay from checkpoints.",
    "ro": "Starea nu este stocată direct - este reconstruită prin replay din checkpoint-uri."
  }
}
