{
  "id": "reasoning",
  "title": "Work Signatures - Auditable, Inspectable Reasoning",
  "narrations": {
    "en": "Now we reach the pinnacle: reasoning that you can inspect, audit, and trust. Unlike neural networks that hide their reasoning in mysterious vectors, our system shows its work.\n\nA \"signature\" - let's unpack this word. In biology, a signature is a distinctive pattern that identifies something: the signature of a disease in blood markers, the signature of a species in its DNA. In our system, a signature is a structured fact - a pattern of roles and values that captures a piece of knowledge.\n\nConsider the fact: \"Alice enters the kitchen.\" We represent this as a signature with three roles: subject = \"Alice\", predicate = \"enters\", object = \"kitchen\". It's explicit, structured, inspectable.\n\nNow comes the magic: pattern matching with variables. A pattern like \"?x enters the kitchen\" uses ?x as a variable - a placeholder that can match anything. When we match this pattern against our fact, we discover that ?x binds to \"Alice\".\n\nThis process is called \"unification\" - from logic programming and theorem proving. We're unifying a pattern against stored facts to discover bindings. Each successful unification is a step in a derivation chain.\n\nWhy does this matter? Because you can trace backwards. If the system concludes \"Alice is in the kitchen,\" you can ask: \"Why?\" And it can show you the exact chain of facts and rules that led to that conclusion. This is auditable reasoning.\n\nIn an era of AI systems that can't explain themselves, this is revolutionary. Every conclusion has a provenance - a history of how it was derived. You don't have to trust a black box; you can verify the reasoning yourself.\n\nThis connects to the legal concept of \"showing your work\" - in courtrooms, in science, in engineering. Conclusions without justification are just claims. Reasoning that can be inspected is reasoning that can be trusted.",
    "ro": "Acum ajungem la vârf: raționament pe care îl poți inspecta, audita și în care poți avea încredere. Spre deosebire de rețelele neurale care își ascund raționamentul în vectori misterioși, sistemul nostru își arată munca.\n\nO \"semnătură\" - să despachetăm acest cuvânt. În biologie, o semnătură este un pattern distinctiv care identifică ceva: semnătura unei boli în markeri sangvini, semnătura unei specii în ADN-ul său. În sistemul nostru, o semnătură este un fapt structurat - un pattern de roluri și valori care capturează o bucată de cunoaștere.\n\nConsideră faptul: \"Alice intră în bucătărie.\" Îl reprezentăm ca o semnătură cu trei roluri: subiect = \"Alice\", predicat = \"intră\", obiect = \"bucătărie\". Este explicit, structurat, inspectabil.\n\nAcum vine magia: potrivirea pattern-urilor cu variabile. Un pattern precum \"?x intră în bucătărie\" folosește ?x ca variabilă - un substituent care poate potrivi orice. Când potrivim acest pattern cu faptul nostru, descoperim că ?x se leagă de \"Alice\".\n\nAcest proces se numește \"unificare\" - din programarea logică și demonstrarea teoremelor. Unificăm un pattern cu faptele stocate pentru a descoperi legăturile. Fiecare unificare reușită este un pas într-un lanț de derivare.\n\nDe ce contează? Pentru că poți urma înapoi. Dacă sistemul concluzionează \"Alice este în bucătărie,\" poți întreba: \"De ce?\" Și poate să îți arate lanțul exact de fapte și reguli care au dus la acea concluzie. Acesta este raționament auditabil.\n\nÎntr-o eră a sistemelor AI care nu se pot explica, aceasta este revoluționar.\n\nAceasta se leagă de ideea de \"arată-ți munca\" - în săli de judecată, în știință, în inginerie. Concluziile fără justificare sunt doar afirmații. Raționamentul care poate fi inspectat este raționamentul în care poți avea încredere."
  },
  "keyIdeas": {
    "en": "Reasoning is explicit and inspectable. No hidden vectors, just bindings.",
    "ro": "Raționamentul este explicit și inspectabil. Fără vectori ascunși, doar legături."
  }
}
