{
  "id": "retrieval",
  "title": "Grounded RAG - Evidence-Based Retrieval",
  "narrations": {
    "en": "Now we connect memory to question answering. Retrieval-Augmented Generation (RAG) is the idea of answering with help from stored facts, instead of relying only on a model's internal weights.\n\nBut there is a catch: if you just retrieve a few passages and then ask a model to summarize, it can still hallucinate. Grounded RAG adds an answer contract: every claim in the answer must be traceable to specific stored facts, with provenance.\n\nStep by step in this system:\n\n1) Break the question into sub-queries. Often you need to identify an entity, a predicate, and sometimes a time window.\n\n2) Retrieve candidate facts from memory. The grid and the VSA index propose candidate locations; the episodic store can provide the original chunks.\n\n3) Score and filter. Prefer higher consensus, more recent timestamps, and higher-quality sources.\n\n4) Generate an answer with explicit evidence links. If evidence supports the claim, we mark it supported. If sources disagree, we mark it conflicting. If we cannot find enough evidence, we mark it unsupported instead of guessing.\n\nThe goal is not just a fluent answer. The goal is an answer you can audit.",
    "ro": "Acum conectăm memoria la întrebări și răspunsuri. Retrieval-Augmented Generation (RAG) este ideea că răspunzi cu ajutorul faptelor stocate, nu doar din „greutățile” interne ale unui model.\n\nDar există o capcană: dacă doar recuperezi câteva pasaje și apoi ceri unui model să rezume, el poate încă să halucineze. Grounded RAG adaugă un contract al răspunsului: fiecare afirmație din răspuns trebuie să poată fi trasată înapoi la fapte concrete, cu proveniență.\n\nPas cu pas în acest sistem:\n\n1) Descompunem întrebarea în sub-interogări. De multe ori trebuie să identifici o entitate, un predicat și uneori o fereastră temporală.\n\n2) Recuperăm fapte candidate din memorie. Grila și indexul VSA propun locații candidate; stocul episodic poate furniza și fragmentele originale.\n\n3) Scorăm și filtrăm. Preferăm consens mai mare, timestamp-uri mai recente și surse de calitate mai bună.\n\n4) Generăm un răspuns cu legături explicite către evidență. Dacă evidența susține afirmația, o marcăm „supported”. Dacă sursele nu sunt de acord, o marcăm „conflicting”. Dacă nu găsim suficientă evidență, o marcăm „unsupported” în loc să ghicim.\n\nScopul nu este doar un răspuns fluent. Scopul este un răspuns pe care îl poți audita."
  },
  "keyIdeas": {
    "en": "Every answer traces back to source facts. Retrieval is auditable.",
    "ro": "Fiecare răspuns se întoarce la fapte sursă. Recuperarea este auditabilă."
  }
}
