{
  "id": "conflict",
  "title": "Conflict Detection - When Facts Disagree",
  "narrations": {
    "en": "Not all evidence agrees. In real data, you will often find two statements that cannot both be true at the same time. That is not a bug; it is what the world looks like.\n\nIn this system, a conflict is detected when two facts match the same entity and the same predicate, but disagree on the value or on an incompatible time range. For example: population(Paris) = 10M versus population(Paris) = 12M.\n\nStep by step:\n\n1) Normalize the entity (so different surface names are treated as the same thing).\n\n2) Match work signatures by pattern: same subject, same predicate.\n\n3) Compare values and constraints (numbers, units, time).\n\n4) If they are incompatible, surface a conflict object that keeps both claims, each with provenance: who said it, when, and how confident.\n\nThen comes resolution, but resolution is optional. We can prefer newer facts, more credible sources, or the consensus of multiple columns. And if we cannot resolve safely, we do not guess. We keep both and answer explicitly: conflicting.\n\nThis is what makes the system auditable: it shows disagreement instead of hiding it.",
    "ro": "Nu toate dovezile sunt de acord. În date reale, vei găsi frecvent două afirmații care nu pot fi ambele adevărate în același timp. Asta nu este un bug; așa arată lumea.\n\nÎn acest sistem, un conflict este detectat atunci când două fapte se potrivesc pe aceeași entitate și același predicat, dar nu sunt de acord asupra valorii sau asupra unei ferestre temporale incompatibile. De exemplu: populație(Paris) = 10 milioane versus populație(Paris) = 12 milioane.\n\nPas cu pas:\n\n1) Normalizăm entitatea (ca nume diferite la suprafață să fie tratate ca același lucru).\n\n2) Potrivim semnăturile de lucru după pattern: același subiect, același predicat.\n\n3) Comparăm valorile și constrângerile (numere, unități, timp).\n\n4) Dacă sunt incompatibile, scoatem la suprafață un obiect de conflict care păstrează ambele afirmații, fiecare cu proveniență: cine a spus-o, când, și cu ce încredere.\n\nApoi urmează rezolvarea, dar rezolvarea este opțională. Putem prefera fapte mai recente, surse mai credibile, sau consensul mai multor coloane. Și dacă nu putem rezolva în siguranță, nu ghicim. Păstrăm ambele și răspundem explicit: „conflicting”.\n\nAsta face sistemul auditabil: arată dezacordul în loc să-l ascundă."
  },
  "keyIdeas": {
    "en": "Conflicts are surfaced, not hidden. The system says \"I don't know\" when appropriate.",
    "ro": "Conflictele sunt scoase la lumină, nu ascunse. Sistemul spune \"nu știu\" când e cazul."
  }
}
