{
  "id": "knobs",
  "title": "System Knobs - Tradeoffs You Can Tune",
  "narrations": {
    "en": "A nice property of this architecture is that its tradeoffs are explicit. You do not have to guess what the model \"learned\" internally. You can tune a small set of knobs and predict the effect.\n\nLet's walk through the main ones.\n\nContext length: this is how many recent tokens we use to compute displacement and to localize. Longer context reduces accidental collisions, because more history makes states more unique. But it costs more compute and it can make the system less responsive to sudden topic shifts.\n\nTop-K per cell: each grid cell stores only the most frequent K tokens. Larger K reduces forgetting, but it also makes cells muddier. Smaller K keeps cells sharp, but you may evict useful rare tokens.\n\nNumber of columns: more columns means more independent hypotheses and more robust consensus. The cost is linear: more compute, more memory, more bookkeeping.\n\nCheckpoint interval: checkpoints are snapshots that make replay fast. Frequent checkpoints speed up reconstruction but cost storage. Sparse checkpoints save space but make replay slower.\n\nThe key point is that these are engineering tradeoffs you can inspect and measure. You can run evals, change one knob, and see exactly what changed.",
    "ro": "Un lucru plăcut la această arhitectură este că tradeoff-urile ei sunt explicite. Nu trebuie să ghicești ce a \"învățat\" modelul în interior. Poți regla un set mic de butoane și poți anticipa efectul.\n\nHai să le parcurgem pe cele principale.\n\nLungimea contextului: asta este câte token-uri recente folosim ca să calculăm deplasarea și ca să localizăm. Un context mai lung reduce coliziunile accidentale, pentru că mai mult istoric face stările mai distincte. Dar costă mai mult calcul și poate face sistemul mai puțin receptiv la schimbări bruște de subiect.\n\nTop-K per celulă: fiecare celulă din grilă păstrează doar cele mai frecvente K token-uri. Un K mai mare reduce uitarea, dar face celulele mai \"noroioase\". Un K mai mic păstrează celulele clare, dar poți evacua token-uri rare care ar fi fost utile.\n\nNumărul de coloane: mai multe coloane înseamnă mai multe ipoteze independente și un consens mai robust. Costul este liniar: mai mult calcul, mai multă memorie, mai multă evidență de urmărit.\n\nIntervalul de checkpoint: checkpoint-urile sunt instantanee care fac reluarea rapidă. Checkpoint-uri dese accelerează reconstrucția dar costă stocare. Checkpoint-uri rare economisesc spațiu dar fac reluarea mai lentă.\n\nIdeea cheie este că acestea sunt tradeoff-uri inginerești pe care le poți inspecta și măsura. Poți rula evaluări, schimbi un singur knob și vezi exact ce s-a modificat."
  },
  "keyIdeas": {
    "en": "The architecture is tunable and inspectable: you can see the tradeoffs.",
    "ro": "Arhitectura este reglabilă și inspectabilă: poți vedea compromisurile."
  }
}
